Repository: quarkusio/cn.quarkus.io
Catalog: l10n/tmx/quarkus.tmx
Source language: en
Languages: zh_cn

source: The one current restriction is that extensions should work in both OpenJDK and GraalVM native executables. That is the guarantee we give Quarkus users (a cross compilation for their app). We have a maturity model to improve an extension to be fully "Quarked" and benefit from Quarkus, all done in incremental steps. Just hop on our https://quarkus.io/community/#discussions[mailing list] to discuss your ideas and get help. And you can start reading our https://quarkus.io/guides/writing-extensions[Writing extensions guide] as well or more simply get inspiration from the https://github.com/quarkusio/quarkus/tree/main/extensions[existing ones].
zh_cn: 当前的一个限制是，扩展必须同时在OpenJDK和GraalVM本机可执行文件中工作。这是我们给Quarkus用户的保证(他们应用程序的交叉编译)。我们有一个成熟度模型来改进扩展，使其完全 "Quarked" ，并从Quarkus中受益，所有这些都是在增量步骤中完成的。请登录我们的 https://quarkus.io/community/#discussions[邮件列表] 讨论您的想法并获得帮助。你也可以开始阅读我们的 https://quarkus.io/guides/writing-extensions[编写扩展指南]，或者更简单地从 https://github.com/quarkusio/quarkus/tree/main/extensions[现有的扩展] 中获得灵感。

source: The parameter of the `process` method is the incoming message payload, whereas the return value will be used as the outgoing message payload. Previously mentioned signatures for parameter and return types are also supported, such as `Message<T>`, `Record<K, V>`, etc.
zh_cn: `process` 方法的参数是传入的消息的payload，而返回值将被用作传出的消息的payload。之前提到的参数和返回类型的签名也被支持，如 `Message<T>` ， `Record<K, V>` 等等。

source: The parameters passed to the application are described in the datasource guide. There are other ways to configure the application - please check the xref:config-reference.adoc#configuration-sources[configuration guide] to have an overview of the possibilities (such as env variable, .env files and so on).
zh_cn: 数据源指南中描述了这些传递给应用程序的参数。还有其他方法可以配置应用程序——请查看 xref:config-reference.adoc#configuration_sources[配置指南]来了解各种可能性（例如`env`变量，`.env`文件等）。

source: The parameters passed to the application are described in the datasource guide. There are other ways to configure the application - please check the xref:config-reference.adoc#configuration_sources[configuration guide] to have an overview of the possibilities (such as env variable, .env files and so on).
zh_cn: 传递给应用程序的参数在数据源指南中进行了描述。还有其他配置应用程序的方法 - 请查看 xref:config-reference.adoc#configuration_sources[配置指南]来概览各种可能性（例如env变量，.env文件等等）。

source: The password used to authenticate to the broker Type: _string_
zh_cn: 用于对代理进行身份验证的密码 类型: _string_

source: The patterns are valid Java regexps. Here we include all the XML files and JSON files into the native executable.
zh_cn: 这些模式都是有效的Java重组函数。在这里，我们将所有的XML文件和JSON文件纳入原生可执行文件。

source: The payload is converted to JSON (using a Json Mapper). The result is wrapped into AMQP Data using a **binary** content. The `content-type` is set to `application/json`
zh_cn: 有效载荷被转换为JSON（使用Json Mapper）。结果被包装成使用 *二进制* 内容的AMQP数据。 `content-type` 被设置为 `application/json`

source: The period (in milliseconds) between two attempts to retrieve the credits granted by the broker. This time is used when the sender run out of credits. Type: _int_
zh_cn: 两次尝试检索代理授予的信用额度之间的时间段（以毫秒为单位）。当发送者用完信用额度的时候使用这个时间。 类型: _int_

source: The polling timeout in milliseconds. When polling records, the poll will wait at most that duration before returning records. Default is 1000ms Type: _int_
zh_cn: 以毫秒为单位的轮询超时时间。当轮询记录时，轮询将在返回记录之前最多等待该时间段。默认是1000ms 类型: _int_

source: The port is `9093`.
zh_cn: 该端口为 `9093` 。

source: The previous example uses Mutiny reactive types. If you are not familiar with Mutiny, check xref:mutiny-primer.adoc[Mutiny - an intuitive reactive programming library].
zh_cn: 前面的例子使用了Mutiny响应式类型。如果你不熟悉Mutiny，请查看 link:mutiny-primer.html[Mutiny - 一个直观的响应式编程库] 。

source: The previous examples use synchronous processing. Asynchronous processing is also possible by returning either an `io.smallrye.mutiny.Uni` or a `java.util.concurrent.CompletionStage`:
zh_cn: 前面的例子使用了同步处理。异步处理也可以通过返回一个 `io.smallrye.mutiny.Uni` 或一个 `java.util.concurrent.CompletionStage` 。

source: The previous section showed you how to build a native executable using Maven or Gradle, but it requires you to have created the native executable first. In addition, this native executable must be a Linux 64 bits executable.
zh_cn: 上一节向你展示了如何使用Maven或Gradle构建原生可执行文件，但这需要你先创建原生可执行文件。此外，这个原生可执行文件必须是Linux 64位可执行文件。

source: The process for Gradle is analogous.
zh_cn: Gradle的过程是类似的。

source: The produced executable will be a 64 bit Linux executable, so depending on your operating system it may no longer be runnable. However, it's not an issue as we are going to copy it to a container. The project generation has provided a `Dockerfile.native-micro` in the `src/main/docker` directory with the following content:
zh_cn: 产生的可执行文件将是一个64位的Linux可执行文件，所以取决于您的操作系统，它可能不再能够运行。然而，这不是一个问题，因为我们要把它复制到一个容器中。生成的项目在 `src/main/docker` 目录中提供了一个 `Dockerfile.native-micro` ，内容如下：

source: The produced executable will be a 64-bit Linux executable, so depending on your operating system it may no longer be runnable. However, it's not an issue as we are going to copy it to a container. The project generation has provided a `Dockerfile.native-micro` in the `src/main/docker` directory with the following content:
zh_cn: 产生的可执行文件将是一个64位的Linux可执行文件，所以如果您的操作系统不支持，它可能不能运行。但由于我们会把它复制到容器中，所以这不是一个问题。自动生成的项目在 `src/main/docker` 目录中提供了一个 `Dockerfile.native-micro` ，内容如下：

source: The project generation has also provided a `Dockerfile.native` in the `src/main/docker` directory with the following content:
zh_cn: 生成的项目也在 `src/main/docker` 目录中提供了一个 `Dockerfile.native` ，内容如下：

source: The project should also contain a simple test:
zh_cn: 该项目还应该包含一个简单的测试：

source: The projection class needs to be a valid Java Bean and have a constructor that contains all its attributes, this constructor will be used to instantiate the projection DTO instead of using the entity class. This class must have a matching constructor with all the class attributes as parameters.
zh_cn: 投影类必须是有效的Java Bean，并且拥有一个包含所有属性的构造方法，这个构造函数用于实例化投影DTO，而不是使用实体类。投影类必须有一个包含所有的类属性作为参数的构造方法。

source: The projection class needs to be a valid Java Bean and have a constructor that contains all its attributes, this constructor will be used to instantiate the projection DTO instead of using the entity class. This must be the only constructor of the class.
zh_cn: 投影类必须是有效的Java Bean，并且拥有一个包含所有属性的构造方法，这个构造方法用于实例化投影DTO，而不是使用实体类。这个构造方法必须是唯一的构造方法。

source: The properties are shown below:
zh_cn: 这些属性显示如下：

source: The reactive API of the MongoDB with Panache uses Mutiny reactive types. If you are not familiar with Mutiny, check xref:mutiny-primer.adoc[Mutiny - an intuitive reactive programming library].
zh_cn: Panache的MongoDB的反应式API使用Mutiny反应式类型。如果你不熟悉Mutiny，请查看 link:mutiny-primer.html[Mutiny - 一个直观的响应式编程库] 。

source: The reactive variant of the `Person` class will be:
zh_cn: `Person` 类的响应式变形将是：

source: The reason for this is that the local build driver invoked through `-Dquarkus.native.container-build=true` uses volume mounts to make the JAR available in the build container, but volume mounts do not work with remote daemons. The remote container build driver copies the necessary files instead of mounting them. Note that even though the remote driver also works with local daemons, the local driver should be preferred in the local case because mounting is usually more performant than copying.
zh_cn: 原因是通过 `-Dquarkus.native.container-build=true` 调用的本地构建驱动程序使用卷挂载来使 JAR 在构建容器中可用，但卷挂载对远程守护程序不起作用。远程容器构建驱动程序复制必要的文件，而不是挂载它们。请注意，即使远程驱动程序也能与本地守护进程一起工作，但在本地情况下，本地驱动程序应该是首选，因为挂载通常比复制性能更高。

source: The reason of this restriction is that `@QuarkusTest` starts a Quarkus server for the whole lifetime of the tests execution run, thus preventing the other tests to start their own Quarkus server.
zh_cn: 这个限制的原因是 `@QuarkusTest` 会在测试执行的整个生命周期内启动一个Quarkus服务器，从而防止其他测试启动自己的Quarkus服务器。

source: The record written on the dead letter queue contains a set of additional headers about the original record:
zh_cn: 所有写入dead letter queue中的记录将包含一组关于原始记录的附加headers：

source: The reply we build up makes use of the caller name, the `isSecure()` and `getAuthenticationScheme()` states of the request `SecurityContext`, and whether a non-null `JsonWebToken` was injected.
zh_cn: 当我们建立的回复时使用调用者的名字，和 `isSecure()` 和 `getAuthenticationScheme()` 这两个 `SecurityContext` 的状态，以及是否注入了非空的 `JsonWebToken` 。

source: The repository type to store JBeret and Job data. A jdbc type requires a JDBC datasource.
zh_cn: 存储JBeret和Job数据的存储库类型。jdbc类型需要JDBC数据源。

source: The request is received by the `greeting` method
zh_cn: 该请求由 `greeting` 方法接收

source: The response indicates that, in addition to the English page, there are a German and a French page about Quarkus on wikipedia.
zh_cn: 该响应表明，除了英文页面，维基百科上还有关于 Quarkus 的德文和法文页面。

source: The rest of the documentation show usages based on the active record pattern only, but keep in mind that they can be performed with the repository pattern as well. The repository pattern examples have been omitted for brevity.
zh_cn: 其余的文档只展示了基于活动记录模式的用法，但请记住，这些用法也可以用资源库模式来执行。为了简洁起见，已省略存储库模式示例。

source: The result should be: `Hello world` as it is the value obtained from the Spring Cloud Config server.
zh_cn: 结果应该是： `Hello world` ，因为这是从Spring Cloud 配置服务器(Config Server)上获取的值。

source: The same query facility exists for the reactive types, but the `stream()` methods act differently: they return a `Multi` (which implement a reactive stream `Publisher`) instead of a `Stream`.
zh_cn: 响应类型存在相同的查询工具，但 `stream()` 方法的作用不同：它们返回一个 `Multi` （实现了反应式流 `Publisher` ），而不是 `Stream` 。

source: The second application, the `processor`, in turn, will read from the `quote-requests` queue put a random price to the quote, and send it to a queue named `quotes`.
zh_cn: 反过来，第二个应用程序 `processor` ，将读取 `quote-requests` 队列，将一个随机价格放入报价，并将其发送给一个名为 `quotes` 的队列。

source: The second example shows the use of lambda scoped transactions, the first just runs a `Runnable` within a transaction, the second, runs `Callable` with some specific options. In particular the `exceptionHandler` method can be used to control if the transaction is rolled back or not on exception, and the `semantic` method controls the behaviour if an existing transaction is already started.
zh_cn: 第二个例子展示了lambda范围内事务的使用，第一个例子只是在一个事务中运行 `Runnable` ，第二个例子，运行 `Callable` ，并带有一些特定的选项。特别是 `exceptionHandler` 方法可以用来控制事务是否在异常情况下回滚，而 `semantic` 方法可以控制现有事务已经开始时的行为。

source: The second stage is a minimal image copying the produced native executable
zh_cn: 第二阶段是复制产生了原生可执行文件的最小镜像

source: The serializer classname used to serialize the payload Type: _string_
zh_cn: 用于序列化payload的序列化器的类名 类型: _string_

source: The serializer classname used to serialize the record's key Type: _string_
zh_cn: 用来序列化记录的键的序列化器类名 类型: _string_

source: The solution is located in the `amqp-quickstart` {quickstarts-tree-url}/amqp-quickstart[directory].
zh_cn: 解决方案位于 `amqp-quickstart` {quickstarts-tree-url}/amqp-quickstart[目录]中。

source: The solution is located in the `getting-started-testing` {quickstarts-tree-url}/getting-started-testing[directory].
zh_cn: 该解决方案位于 `getting-started-testing` {quickstarts-tree-url}/getting-started-testing[目录]中。

source: The solution is located in the `getting-started` directory.
zh_cn: 该解决方案位于 `getting-started` 目录中。

source: The solution is located in the `getting-started` {quickstarts-tree-url}/getting-started[directory].
zh_cn: 该解决方案位于 `getting-started` {quickstarts-tree-url}/getting-started[目录] 中。

source: The solution is located in the `hibernate-orm-panache-quickstart` {quickstarts-tree-url}/hibernate-orm-panache-quickstart[directory].
zh_cn: 该解决方案位于 `hibernate-orm-panache-quickstart` {quickstarts-tree-url}/hibernate-orm-panache-quickstart[目录] 中。

source: The solution is located in the `hibernate-reactive-panache-quickstart` {quickstarts-tree-url}/hibernate-reactive-panache-quickstart[directory].
zh_cn: 该解决方案位于 `hibernate-reactive-panache-quickstart` {quickstarts-tree-url}/hibernate-reactive-panache-quickstart[目录] 中。

source: The solution is located in the `micrometer-quickstart` {quickstarts-tree-url}/micrometer-quickstart[directory].
zh_cn: 该解决方案位于 `micrometer-quickstart` {quickstarts-tree-url}/micrometer-quickstart[目录]中。

source: The solution is located in the `mongodb-panache-quickstart` {quickstarts-tree-url}/mongodb-panache-quickstart[directory].
zh_cn: 该解决方案位于 `mongodb-panache-quickstart` {quickstarts-tree-url}/mongodb-panache-quickstart[目录] 中。

source: The solution is located in the `mongodb-quickstart` {quickstarts-tree-url}/mongodb-quickstart[directory].
zh_cn: 该解决方案位于 `mongodb-quickstart` {quickstarts-tree-url}/mongodb-quickstart[目录]中。

source: The solution is located in the `opentelemetry-quickstart` {quickstarts-tree-url}/opentelemetry-quickstart[directory].
zh_cn: 该解决方案位于 `opentelemetry-quickstart` {quickstarts-tree-url}/opentelemetry-quickstart[目录]中。

source: The solution is located in the `redis-quickstart` {quickstarts-tree-url}/redis-quickstart[directory].
zh_cn: 该解决方案位于 `redis-quickstart` {quickstarts-tree-url}/redis-quickstart[目录]中。

source: The solution is located in the `rest-json-quickstart` {quickstarts-tree-url}/rest-json-quickstart[directory].
zh_cn: 该解决方案位于 `rest-json-quickstart` {quickstarts-tree-url}/rest-json-quickstart[目录]中。

source: The solution is located in the `security-jwt-quickstart` {quickstarts-tree-url}/security-jwt-quickstart[directory].
zh_cn: 该解决方案位于 `security-jwt-quickstart` {quickstarts-tree-url}/security-jwt-quickstart[目录]中。

source: The solution is located in the `security-keycloak-authorization-quickstart` {quickstarts-tree-url}/security-keycloak-authorization-quickstart[directory].
zh_cn: 该方案位于 `security-keycloak-authorization-quickstart` {quickstarts-tree-url}/security-keycloak-authorization-quickstart[目录]中。

source: The solution is located in the `security-openid-connect-quickstart` {quickstarts-tree-url}/security-openid-connect-quickstart[directory].
zh_cn: 该解决方案位于 `security-openid-connect-quickstart` {quickstarts-tree-url}/security-openid-connect-quickstart[目录]中。

source: The solution is located in the `spring-boot-properties-quickstart` {quickstarts-tree-url}/spring-boot-properties-quickstart[directory].
zh_cn: 该解决方案位于 `spring-boot-properties-quickstart` {quickstarts-tree-url}/spring-boot-properties-quickstart[目录]中。

source: The solution is located in the `spring-scheduled-quickstart` {quickstarts-tree-url}/spring-scheduled-quickstart[directory].
zh_cn: 该解决方案位于 `spring-scheduled-quickstart` {quickstarts-tree-url}/spring-scheduled-quickstart[目录]中。

source: The solution is located in the `vertx-quickstart` {quickstarts-tree-url}/vertx-quickstart[directory].
zh_cn: 该解决方案位于 `vertx-quickstart` {quickstarts-tree-url}/vertx-quickstart[目录]中。

source: The solution repository located in the `security-jwt-quickstart` {quickstarts-tree-url}/security-jwt-quickstart[directory] contains all the versions we have worked through in this quickstart guide as well as some additional endpoints that illustrate subresources with injection of ``JsonWebToken``s and their claims into those using the CDI APIs. We suggest that you check out the quickstart solutions and explore the `security-jwt-quickstart` directory to learn more about the {extension-name} extension features.
zh_cn: 位于 `security-jwt-quickstart` {quickstarts-tree-url}/security-jwt-quickstart[目录]中的解决方案库包含了我们在本快速入门指南中研究过的所有版本，以及一些额外的端点，用以说明将 `JsonWebToken` 及其声明注入到那些使用CDI APIs的子资源。我们建议你查看快速入门解决方案并探索 `security-jwt-quickstart` 目录，以了解更多关于{extension-name}扩展功能的信息。

source: The source cache is located in the `target/sources` folder.
zh_cn: 源缓存位于 `target/sources` 文件夹中。

source: The source code for the `/api/admin` endpoint is also very simple. The main difference here is that we are using a `@RolesAllowed` annotation to make sure that only users granted with the `admin` role can access the endpoint:
zh_cn: 端点 `/api/admin` 的源代码也非常简单。这里的主要区别是，我们使用 `@RolesAllowed` 注解来确保只有被授予 `admin` 角色的用户才能访问该端点：

source: The source code for the `/api/admin` endpoint is also very simple:
zh_cn: `/api/admin` 节点的源代码也非常简单：

source: The source code is hosted on <a href="https://github.com/quarkusio/quarkus">GitHub</a>. If you need to report a bug or request a new feature, look for a similar one on our <a href="https://github.com/quarkusio/quarkus/issues">GitHub issue tracker</a>. If you don’t find any, <a href="https://github.com/quarkusio/quarkus/issues/new/choose">create a new issue</a>.
zh_cn: 源代码被托管在<a href="https://github.com/quarkusio/quarkus">GitHub</a>。如果您需要报告一个错误或要求一个新功能，请在我们的<a href="https://github.com/quarkusio/quarkus/issues">GitHub问题跟踪</a>上寻找类似的问题。如果您没有找到，<a href="https://github.com/quarkusio/quarkus/issues/new/choose">创建一个新问题</a>。

source: The strategy is selected using the `failure-strategy` attribute.
zh_cn: 失败策略通过 `failure-strategy` 属性来设置。

source: The support for Apache Camel on top of Quarkus is provided by the https://github.com/apache/camel-quarkus[Apache Camel Quarkus project]. Please refer to https://camel.apache.org/camel-quarkus/latest/[their documentation] for more information.
zh_cn: 在Quarkus上对Apache Camel的支持由 https://github.com/apache/camel-quarkus[Apache Camel Quarkus 项目] 提供。 有关更多信息，请参阅 https://camel.apache.org/camel-quarkus/latest/[他们的文档] 。

source: The support for multiple persistence units is described in detail in xref:hibernate-orm.adoc#multiple-persistence-units[the Hibernate ORM guide].
zh_cn: 在 link:hibernate-orm.html#multiple-persistence-units[Hibernate ORM指南] 中对多个持久化单元的支持有详细描述。

source: The table below gives an overview of the current IDEs with links and a high-level overview of their features.
zh_cn: 下表给出了当前支持的集成开发环境的概述，并附有链接和其功能概述。

source: The target partition id. -1 to let the client determine the partition Type: _int_
zh_cn: 目标分区的ID。设置为-1可以客户端自行确定分区 类型: _int_

source: The test port can be controlled via the `quarkus.http.test-port` config property. Quarkus also creates a system property called `test.url` that is set to the base test URL for situations where you cannot use injection.
zh_cn: 测试端口可以通过 `quarkus.http.test-port` 配置属性来控制。Quarkus还创建了一个名为 `test.url` 的系统属性，在不能使用注入的情况下被设置为基本测试URL。

source: The time-to-live of the sent AMQP messages. 0 to disable the TTL Type: _long_
zh_cn: 发送的AMQP消息的生存时间。0表示禁用TTL 类型: _long_

source: The total bytes of memory the producer can use to buffer records waiting to be sent to the server. Type: _long_
zh_cn: 生产者可用于缓冲等待发送至服务器的记录的总字节数。 类型: _long_

source: The transaction context is propagated to all calls nested in the `@Transactional` method as you would expect (in this example `childDAO.addToGiftList()` and `santaDAO.addToSantaTodoList()`). The transaction will commit unless a runtime exception crosses the method boundary. You can override whether an exception forces the rollback or not by using `@Transactional(dontRollbackOn=SomeException.class)` (or `rollbackOn`).
zh_cn: 正如你所期望的那样，事务上下文被传播并嵌套在 `@Transactional` 方法中的所有调用（在这个例子中 `childDAO.addToGiftList()` 和 `santaDAO.addToSantaTodoList()` ）。除非有运行时异常穿越方法边界，否则事务将会提交。你可以通过使用 `@Transactional(dontRollbackOn=SomeException.class)` （或 `rollbackOn` ）来覆盖异常是否强制回滚。

source: The use of multiple MongoDB clients enables multi-tenancy for MongoDB by allowing to connect to multiple MongoDB clusters. + If you want to connect to multiple databases inside the same cluster, multiple clients are **not** necessary as a single client is able to access all databases in the same cluster (like a JDBC connection is able to access to multiple schemas inside the same database).
zh_cn: 多个 MongoDB 客户端的使用通过允许连接到多个 MongoDB 集群来实现 MongoDB 的多租户。+ 如果你想连接同一集群内的多个数据库，则 **不** 需要使用多个客户端，因为单个客户端能够访问同一集群内的所有数据库（就像JDBC连接能够访问同一数据库内的多个模式）。

source: The username is the `$ConnectionString` string.
zh_cn: 用户名是 `$ConnectionString` 字符串。

source: The username used to authenticate to the broker Type: _string_
zh_cn: 用于对代理进行身份验证的用户名 类型: _string_

source: The value held by the Redis key
zh_cn: Redis的Key所持有的值

source: The values from this file override any values from the regular `application.yaml` file if exists.
zh_cn: 如果存在的话，此文件中的值将覆盖常规 `application.yaml` 文件中的任何值。

source: The website deployment is automatically performed by GitHub Actions (when commits are pushed to the `develop` branch). If for some reason you need to deploy from your local machine, follow these instructions:
zh_cn: 网站部署由GitHub Actions自动执行(当提交被推送到 `develop` 分支时)。 如果由于某些原因需要从本地机器进行部署，请遵循以下说明：

source: The workaround is a bit more complex as besides sending the fruits coming from Kafka, we need to send pings periodically. To achieve this we merge the stream coming from Kafka and a periodic stream emitting `{}` every 10 seconds.
zh_cn: 该替代方法有点复杂，因为除了发送来自Kafka的fruit实例，我们还需要定期发送ping。为了实现这一点，我们合并了来自Kafka的数据流和一个每10秒发送一个 `{}` 的数据流。

source: The xref:mongodb-panache.adoc[MongoDB with Panache] extension facilitates the usage of MongoDB by providing active record style entities (and repositories) like you have in xref:hibernate-orm-panache.adoc[Hibernate ORM with Panache] and focuses on making your entities trivial and fun to write in Quarkus.
zh_cn: link:mongodb-panache.html[MongoDB with Panache] 扩展通过提供活动记录样式实体（和存储库）来促进 MongoDB 的使用，就像您在 link:hibernate-orm-panache.html[Hibernate ORM with Panache] 中所拥有的一样，并关注让你的实体在 Quarkus 中编写变得简单而有趣。

source: Then add the relevant configuration properties in `{config-file}`.
zh_cn: 然后在 `{config-file}` 中添加相关的配置属性。

source: Then check that the endpoint returns `hello quarkus` as expected:
zh_cn: 然后检查端点是否按预期返回 `hello quarkus` :

source: Then execute the following sequence:
zh_cn: 然后执行以下命令序列：

source: Then run it:
zh_cn: 然后运行：

source: Then try the following sequence and look for `example_list_size` in the plain text output:
zh_cn: 然后尝试以下命令并在文本输出中找出 `example_list_size` ：

source: Then use `@QuarkusTestResource` to configure the Kafka Companion in tests, for example:
zh_cn: 然后使用 `@QuarkusTestResource` 在测试中配置Kafka Companion，比如：

source: Then visit the http://localhost:16686[Jaeger UI] to see the tracing information.
zh_cn: 然后访问 link:http://localhost:16686[Jaeger界面] 来查看追踪信息。

source: Then you need to create a `CodecProvider` to link this `Codec` to the `Fruit` class.
zh_cn: 然后你需要创建一个 `CodecProvider` 来把这个 `Codec` 链接到 `Fruit` 类。

source: Then, create a Quarkus Test Resource as follows:
zh_cn: 然后，按以下方法创建Quarkus测试资源：

source: Then, create the native executable with:
zh_cn: 然后，用以下方法创建本地可执行文件：

source: Then, deploy the verticle instances with:
zh_cn: 然后，用以下方法部署verticle实例。

source: Then, deploy your verticle as follows:
zh_cn: 然后，按以下方式部署你的verticle：

source: Then, if you didn't delete the generated native executable, you can build the docker image with:
zh_cn: 然后，如果你没有删除生成的原生可执行文件，可以用以下方法构建docker镜像：

source: Then, in a terminal, run:
zh_cn: 接着，在终端中，运行以下命令:

source: Then, in the `VertxResource` file add the following method:
zh_cn: 接着，在 `VertxResource` 文件中添加以下方法:

source: Then, invoke the endpoint using:
zh_cn: 接着，使用以下命令请求该端点:

source: Then, launch the application using:
zh_cn: 然后，使用以下命令启动应用程序：

source: Then, open the `src/test/java/org/acme/quickstart/GreetingResourceIT.java`. It contains:
zh_cn: 然后，打开 `src/test/java/org/acme/quickstart/GreetingResourceIT.java` 。它包含了：

source: Then, open the `src/test/java/org/acme/quickstart/NativeGreetingResourceIT.java`. It contains:
zh_cn: 然后，打开 `src/test/java/org/acme/quickstart/NativeGreetingResourceIT.java` 。它包含了：

source: Then, we need to start a Redis instance (if you do not have one already) using the following command:
zh_cn: 如果还没有Redis服务实例，我们需要使用以下命令启动一个Redis实例：

source: Then, you can configure the Quarkus application to connect to the broker as follows:
zh_cn: 然后，您可以配置Quarkus应用程序以连接到broker，如下所示：

source: Then, you can create the following resource to create/read/update/delete your Person entity:
zh_cn: 然后，你可以创建以下资源来create/read/update/delete你的Person实体：

source: Then, you can reconstruct the instance using the `mapTo` method
zh_cn: 然后，你可以使用 `mapTo` 方法重新构建该实例
